/* automatically generated by rust-bindgen 0.72.1 */
/* NB: generated on FreeBSD 14.4 i386 */

pub const NFSV4OP_ACCESS: u32 = 3;
pub const NFSV4OP_CLOSE: u32 = 4;
pub const NFSV4OP_COMMIT: u32 = 5;
pub const NFSV4OP_CREATE: u32 = 6;
pub const NFSV4OP_DELEGPURGE: u32 = 7;
pub const NFSV4OP_DELEGRETURN: u32 = 8;
pub const NFSV4OP_GETATTR: u32 = 9;
pub const NFSV4OP_GETFH: u32 = 10;
pub const NFSV4OP_LINK: u32 = 11;
pub const NFSV4OP_LOCK: u32 = 12;
pub const NFSV4OP_LOCKT: u32 = 13;
pub const NFSV4OP_LOCKU: u32 = 14;
pub const NFSV4OP_LOOKUP: u32 = 15;
pub const NFSV4OP_LOOKUPP: u32 = 16;
pub const NFSV4OP_NVERIFY: u32 = 17;
pub const NFSV4OP_OPEN: u32 = 18;
pub const NFSV4OP_OPENATTR: u32 = 19;
pub const NFSV4OP_OPEN_CONFIRM: u32 = 20;
pub const NFSV4OP_OPEN_DOWNGRADE: u32 = 21;
pub const NFSV4OP_PUTFH: u32 = 22;
pub const NFSV4OP_PUTPUBFH: u32 = 23;
pub const NFSV4OP_PUTROOTFH: u32 = 24;
pub const NFSV4OP_READ: u32 = 25;
pub const NFSV4OP_READDIR: u32 = 26;
pub const NFSV4OP_READLINK: u32 = 27;
pub const NFSV4OP_REMOVE: u32 = 28;
pub const NFSV4OP_RENAME: u32 = 29;
pub const NFSV4OP_RENEW: u32 = 30;
pub const NFSV4OP_RESTOREFH: u32 = 31;
pub const NFSV4OP_SAVEFH: u32 = 32;
pub const NFSV4OP_SECINFO: u32 = 33;
pub const NFSV4OP_SETATTR: u32 = 34;
pub const NFSV4OP_SETCLIENTID: u32 = 35;
pub const NFSV4OP_SETCLIENTID_CONFIRM: u32 = 36;
pub const NFSV4OP_VERIFY: u32 = 37;
pub const NFSV4OP_WRITE: u32 = 38;
pub const NFSV4OPENRES_MLOCK: u32 = 1;
pub const NFSV4OPENRES_CONFIRM: u32 = 2;
pub const NFSV4OPENSHARE_ACCESS_READ: u32 = 1;
pub const NFSV4OPENSHARE_ACCESS_WRITE: u32 = 2;
pub const NFSV4OPENSHARE_ACCESS_BOTH: u32 = 3;
pub const NFSV4OPENSHARE_DENY_NONE: u32 = 0;
pub const NFSV4OPENSHARE_DENY_READ: u32 = 1;
pub const NFSV4OPENSHARE_DENY_WRITE: u32 = 2;
pub const NFSV4OPENSHARE_DENY_BOTH: u32 = 3;
pub const NFSSVC_GETSTATS: u32 = 4194304;
pub const NFSSVC_NEWSTRUCT: u32 = 536870912;
pub const NFSV4OP_OPENCONFIRM: u32 = 20;
pub const NFSV4OP_OPENDOWNGRADE: u32 = 21;
pub const NFSV4OP_SETCLIENTIDCFRM: u32 = 36;
pub const NFSV4OP_RELEASELCKOWN: u32 = 39;
pub const NFSV4OP_NOPS: u32 = 40;
pub const NFSV4OP_BACKCHANNELCTL: u32 = 40;
pub const NFSV4OP_BINDCONNTOSESS: u32 = 41;
pub const NFSV4OP_EXCHANGEID: u32 = 42;
pub const NFSV4OP_CREATESESSION: u32 = 43;
pub const NFSV4OP_DESTROYSESSION: u32 = 44;
pub const NFSV4OP_FREESTATEID: u32 = 45;
pub const NFSV4OP_GETDIRDELEG: u32 = 46;
pub const NFSV4OP_GETDEVINFO: u32 = 47;
pub const NFSV4OP_GETDEVLIST: u32 = 48;
pub const NFSV4OP_LAYOUTCOMMIT: u32 = 49;
pub const NFSV4OP_LAYOUTGET: u32 = 50;
pub const NFSV4OP_LAYOUTRETURN: u32 = 51;
pub const NFSV4OP_SECINFONONAME: u32 = 52;
pub const NFSV4OP_SEQUENCE: u32 = 53;
pub const NFSV4OP_SETSSV: u32 = 54;
pub const NFSV4OP_TESTSTATEID: u32 = 55;
pub const NFSV4OP_WANTDELEG: u32 = 56;
pub const NFSV4OP_DESTROYCLIENTID: u32 = 57;
pub const NFSV4OP_RECLAIMCOMPL: u32 = 58;
pub const NFSV4OP_ALLOCATE: u32 = 59;
pub const NFSV4OP_COPY: u32 = 60;
pub const NFSV4OP_COPYNOTIFY: u32 = 61;
pub const NFSV4OP_DEALLOCATE: u32 = 62;
pub const NFSV4OP_IOADVISE: u32 = 63;
pub const NFSV4OP_LAYOUTERROR: u32 = 64;
pub const NFSV4OP_LAYOUTSTATS: u32 = 65;
pub const NFSV4OP_OFFLOADCANCEL: u32 = 66;
pub const NFSV4OP_OFFLOADSTATUS: u32 = 67;
pub const NFSV4OP_READPLUS: u32 = 68;
pub const NFSV4OP_SEEK: u32 = 69;
pub const NFSV4OP_WRITESAME: u32 = 70;
pub const NFSV4OP_CLONE: u32 = 71;
pub const NFSV4OP_GETXATTR: u32 = 72;
pub const NFSV4OP_SETXATTR: u32 = 73;
pub const NFSV4OP_LISTXATTRS: u32 = 74;
pub const NFSV4OP_REMOVEXATTR: u32 = 75;
pub const NFSV4OP_OPILLEGAL: u32 = 10044;
pub const NFSV4OP_SYMLINK: u32 = 76;
pub const NFSV4OP_MKDIR: u32 = 77;
pub const NFSV4OP_RMDIR: u32 = 78;
pub const NFSV4OP_READDIRPLUS: u32 = 79;
pub const NFSV4OP_MKNOD: u32 = 80;
pub const NFSV4OP_FSSTAT: u32 = 81;
pub const NFSV4OP_FSINFO: u32 = 82;
pub const NFSV4OP_PATHCONF: u32 = 83;
pub const NFSV4OP_V3CREATE: u32 = 84;
pub const NFSV4OP_FAKENOPS: u32 = 9;
pub const NFSV4OP_CBGETATTR: u32 = 3;
pub const NFSV4OP_CBRECALL: u32 = 4;
pub const NFSV4OP_CBNOPS: u32 = 5;
pub const NFSV4OP_CBLAYOUTRECALL: u32 = 5;
pub const NFSV4OP_CBNOTIFY: u32 = 6;
pub const NFSV4OP_CBPUSHDELEG: u32 = 7;
pub const NFSV4OP_CBRECALLANY: u32 = 8;
pub const NFSV4OP_CBRECALLOBJAVAIL: u32 = 9;
pub const NFSV4OP_CBRECALLSLOT: u32 = 10;
pub const NFSV4OP_CBSEQUENCE: u32 = 11;
pub const NFSV4OP_CBWANTCANCELLED: u32 = 12;
pub const NFSV4OP_CBNOTIFYLOCK: u32 = 13;
pub const NFSV4OP_CBNOTIFYDEVID: u32 = 14;
pub const NFSV4OP_CBOFFLOAD: u32 = 15;
pub const NFSSTATS_V1: u32 = 2;
pub type __int32_t = ::std::os::raw::c_int;
pub type __time_t = __int32_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bintime {
    pub sec:  time_t,
    pub frac: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bintime"][::std::mem::size_of::<bintime>() - 12usize];
    ["Alignment of bintime"][::std::mem::align_of::<bintime>() - 4usize];
    ["Offset of field: bintime::sec"]
        [::std::mem::offset_of!(bintime, sec) - 0usize];
    ["Offset of field: bintime::frac"]
        [::std::mem::offset_of!(bintime, frac) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nfsstatsv1 {
    pub vers: ::std::os::raw::c_int,
    pub attrcache_hits: u64,
    pub attrcache_misses: u64,
    pub lookupcache_hits: u64,
    pub lookupcache_misses: u64,
    pub direofcache_hits: u64,
    pub direofcache_misses: u64,
    pub accesscache_hits: u64,
    pub accesscache_misses: u64,
    pub biocache_reads: u64,
    pub read_bios: u64,
    pub read_physios: u64,
    pub biocache_writes: u64,
    pub write_bios: u64,
    pub write_physios: u64,
    pub biocache_readlinks: u64,
    pub readlink_bios: u64,
    pub biocache_readdirs: u64,
    pub readdir_bios: u64,
    pub rpccnt: [u64; 80usize],
    pub rpcretries: u64,
    pub srvrpccnt: [u64; 100usize],
    pub srvlayouts: u64,
    pub cllayouts: u64,
    pub rpcrequests: u64,
    pub rpctimeouts: u64,
    pub rpcunexpected: u64,
    pub rpcinvalid: u64,
    pub srvcache_inproghits: u64,
    pub reserved_2: u64,
    pub srvcache_nonidemdonehits: u64,
    pub srvcache_misses: u64,
    pub srvcache_tcppeak: u64,
    pub srvcache_size: ::std::os::raw::c_int,
    pub srvclients: u64,
    pub srvopenowners: u64,
    pub srvopens: u64,
    pub srvlockowners: u64,
    pub srvlocks: u64,
    pub srvdelegates: u64,
    pub cbrpccnt: [u64; 26usize],
    pub clopenowners: u64,
    pub clopens: u64,
    pub cllockowners: u64,
    pub cllocks: u64,
    pub cldelegates: u64,
    pub cllocalopenowners: u64,
    pub cllocalopens: u64,
    pub cllocallockowners: u64,
    pub cllocallocks: u64,
    pub srvstartcnt: u64,
    pub srvdonecnt: u64,
    pub srvbytes: [u64; 100usize],
    pub srvops: [u64; 100usize],
    pub srvduration: [bintime; 100usize],
    pub busyfrom: bintime,
    pub busytime: bintime,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nfsstatsv1"][::std::mem::size_of::<nfsstatsv1>() - 4856usize];
    ["Alignment of nfsstatsv1"][::std::mem::align_of::<nfsstatsv1>() - 4usize];
    ["Offset of field: nfsstatsv1::vers"]
        [::std::mem::offset_of!(nfsstatsv1, vers) - 0usize];
    ["Offset of field: nfsstatsv1::attrcache_hits"]
        [::std::mem::offset_of!(nfsstatsv1, attrcache_hits) - 4usize];
    ["Offset of field: nfsstatsv1::attrcache_misses"]
        [::std::mem::offset_of!(nfsstatsv1, attrcache_misses) - 12usize];
    ["Offset of field: nfsstatsv1::lookupcache_hits"]
        [::std::mem::offset_of!(nfsstatsv1, lookupcache_hits) - 20usize];
    ["Offset of field: nfsstatsv1::lookupcache_misses"]
        [::std::mem::offset_of!(nfsstatsv1, lookupcache_misses) - 28usize];
    ["Offset of field: nfsstatsv1::direofcache_hits"]
        [::std::mem::offset_of!(nfsstatsv1, direofcache_hits) - 36usize];
    ["Offset of field: nfsstatsv1::direofcache_misses"]
        [::std::mem::offset_of!(nfsstatsv1, direofcache_misses) - 44usize];
    ["Offset of field: nfsstatsv1::accesscache_hits"]
        [::std::mem::offset_of!(nfsstatsv1, accesscache_hits) - 52usize];
    ["Offset of field: nfsstatsv1::accesscache_misses"]
        [::std::mem::offset_of!(nfsstatsv1, accesscache_misses) - 60usize];
    ["Offset of field: nfsstatsv1::biocache_reads"]
        [::std::mem::offset_of!(nfsstatsv1, biocache_reads) - 68usize];
    ["Offset of field: nfsstatsv1::read_bios"]
        [::std::mem::offset_of!(nfsstatsv1, read_bios) - 76usize];
    ["Offset of field: nfsstatsv1::read_physios"]
        [::std::mem::offset_of!(nfsstatsv1, read_physios) - 84usize];
    ["Offset of field: nfsstatsv1::biocache_writes"]
        [::std::mem::offset_of!(nfsstatsv1, biocache_writes) - 92usize];
    ["Offset of field: nfsstatsv1::write_bios"]
        [::std::mem::offset_of!(nfsstatsv1, write_bios) - 100usize];
    ["Offset of field: nfsstatsv1::write_physios"]
        [::std::mem::offset_of!(nfsstatsv1, write_physios) - 108usize];
    ["Offset of field: nfsstatsv1::biocache_readlinks"]
        [::std::mem::offset_of!(nfsstatsv1, biocache_readlinks) - 116usize];
    ["Offset of field: nfsstatsv1::readlink_bios"]
        [::std::mem::offset_of!(nfsstatsv1, readlink_bios) - 124usize];
    ["Offset of field: nfsstatsv1::biocache_readdirs"]
        [::std::mem::offset_of!(nfsstatsv1, biocache_readdirs) - 132usize];
    ["Offset of field: nfsstatsv1::readdir_bios"]
        [::std::mem::offset_of!(nfsstatsv1, readdir_bios) - 140usize];
    ["Offset of field: nfsstatsv1::rpccnt"]
        [::std::mem::offset_of!(nfsstatsv1, rpccnt) - 148usize];
    ["Offset of field: nfsstatsv1::rpcretries"]
        [::std::mem::offset_of!(nfsstatsv1, rpcretries) - 788usize];
    ["Offset of field: nfsstatsv1::srvrpccnt"]
        [::std::mem::offset_of!(nfsstatsv1, srvrpccnt) - 796usize];
    ["Offset of field: nfsstatsv1::srvlayouts"]
        [::std::mem::offset_of!(nfsstatsv1, srvlayouts) - 1596usize];
    ["Offset of field: nfsstatsv1::cllayouts"]
        [::std::mem::offset_of!(nfsstatsv1, cllayouts) - 1604usize];
    ["Offset of field: nfsstatsv1::rpcrequests"]
        [::std::mem::offset_of!(nfsstatsv1, rpcrequests) - 1612usize];
    ["Offset of field: nfsstatsv1::rpctimeouts"]
        [::std::mem::offset_of!(nfsstatsv1, rpctimeouts) - 1620usize];
    ["Offset of field: nfsstatsv1::rpcunexpected"]
        [::std::mem::offset_of!(nfsstatsv1, rpcunexpected) - 1628usize];
    ["Offset of field: nfsstatsv1::rpcinvalid"]
        [::std::mem::offset_of!(nfsstatsv1, rpcinvalid) - 1636usize];
    ["Offset of field: nfsstatsv1::srvcache_inproghits"]
        [::std::mem::offset_of!(nfsstatsv1, srvcache_inproghits) - 1644usize];
    ["Offset of field: nfsstatsv1::reserved_2"]
        [::std::mem::offset_of!(nfsstatsv1, reserved_2) - 1652usize];
    ["Offset of field: nfsstatsv1::srvcache_nonidemdonehits"][::std::mem::offset_of!(
        nfsstatsv1,
        srvcache_nonidemdonehits
    ) - 1660usize];
    ["Offset of field: nfsstatsv1::srvcache_misses"]
        [::std::mem::offset_of!(nfsstatsv1, srvcache_misses) - 1668usize];
    ["Offset of field: nfsstatsv1::srvcache_tcppeak"]
        [::std::mem::offset_of!(nfsstatsv1, srvcache_tcppeak) - 1676usize];
    ["Offset of field: nfsstatsv1::srvcache_size"]
        [::std::mem::offset_of!(nfsstatsv1, srvcache_size) - 1684usize];
    ["Offset of field: nfsstatsv1::srvclients"]
        [::std::mem::offset_of!(nfsstatsv1, srvclients) - 1688usize];
    ["Offset of field: nfsstatsv1::srvopenowners"]
        [::std::mem::offset_of!(nfsstatsv1, srvopenowners) - 1696usize];
    ["Offset of field: nfsstatsv1::srvopens"]
        [::std::mem::offset_of!(nfsstatsv1, srvopens) - 1704usize];
    ["Offset of field: nfsstatsv1::srvlockowners"]
        [::std::mem::offset_of!(nfsstatsv1, srvlockowners) - 1712usize];
    ["Offset of field: nfsstatsv1::srvlocks"]
        [::std::mem::offset_of!(nfsstatsv1, srvlocks) - 1720usize];
    ["Offset of field: nfsstatsv1::srvdelegates"]
        [::std::mem::offset_of!(nfsstatsv1, srvdelegates) - 1728usize];
    ["Offset of field: nfsstatsv1::cbrpccnt"]
        [::std::mem::offset_of!(nfsstatsv1, cbrpccnt) - 1736usize];
    ["Offset of field: nfsstatsv1::clopenowners"]
        [::std::mem::offset_of!(nfsstatsv1, clopenowners) - 1944usize];
    ["Offset of field: nfsstatsv1::clopens"]
        [::std::mem::offset_of!(nfsstatsv1, clopens) - 1952usize];
    ["Offset of field: nfsstatsv1::cllockowners"]
        [::std::mem::offset_of!(nfsstatsv1, cllockowners) - 1960usize];
    ["Offset of field: nfsstatsv1::cllocks"]
        [::std::mem::offset_of!(nfsstatsv1, cllocks) - 1968usize];
    ["Offset of field: nfsstatsv1::cldelegates"]
        [::std::mem::offset_of!(nfsstatsv1, cldelegates) - 1976usize];
    ["Offset of field: nfsstatsv1::cllocalopenowners"]
        [::std::mem::offset_of!(nfsstatsv1, cllocalopenowners) - 1984usize];
    ["Offset of field: nfsstatsv1::cllocalopens"]
        [::std::mem::offset_of!(nfsstatsv1, cllocalopens) - 1992usize];
    ["Offset of field: nfsstatsv1::cllocallockowners"]
        [::std::mem::offset_of!(nfsstatsv1, cllocallockowners) - 2000usize];
    ["Offset of field: nfsstatsv1::cllocallocks"]
        [::std::mem::offset_of!(nfsstatsv1, cllocallocks) - 2008usize];
    ["Offset of field: nfsstatsv1::srvstartcnt"]
        [::std::mem::offset_of!(nfsstatsv1, srvstartcnt) - 2016usize];
    ["Offset of field: nfsstatsv1::srvdonecnt"]
        [::std::mem::offset_of!(nfsstatsv1, srvdonecnt) - 2024usize];
    ["Offset of field: nfsstatsv1::srvbytes"]
        [::std::mem::offset_of!(nfsstatsv1, srvbytes) - 2032usize];
    ["Offset of field: nfsstatsv1::srvops"]
        [::std::mem::offset_of!(nfsstatsv1, srvops) - 2832usize];
    ["Offset of field: nfsstatsv1::srvduration"]
        [::std::mem::offset_of!(nfsstatsv1, srvduration) - 3632usize];
    ["Offset of field: nfsstatsv1::busyfrom"]
        [::std::mem::offset_of!(nfsstatsv1, busyfrom) - 4832usize];
    ["Offset of field: nfsstatsv1::busytime"]
        [::std::mem::offset_of!(nfsstatsv1, busytime) - 4844usize];
};
impl Default for nfsstatsv1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn nfssvc(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
